       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'HELLO'.

       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       01 I PIC 99 VALUE 0.

       PROCEDURE DIVISION.
       MAIN.
           PERFORM HELLO WITH TEST AFTER UNTIL I >= 10.
           STOP RUN.

       HELLO.
           DISPLAY "HELLO, WORLD!".
           ADD 1 TO I.
